print('Задача 4. Площадь треугольника')
# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2
a = int(input("число 1:"))
b = int(input("число 1:"))
c = (a*b)/2
print(c)

