print('Задача 3. Слишком большие числа')
n = int(input('Сумма в счете: '))
sum == 0
while n > 1:
    sum += 1
    i = n % 10
    n //= 10
print(sum)

# У неудачливого бухгалтера всё опять идёт наперекосяк:
# ему приносят такие большие счета, что числа не помещаются на бумаге.
 
# Напишите программу,
# которая считала бы для него,
# сколько десятичных цифр (знаков) во вводимом числе.