print('Задача 1. Кубы чисел')
a = int(input(' введите число: '))
cont = 1
while cont <= a:
    print(cont ** 3)
    cont += 1

# Любителю математики Паше снова стало мало распечатанных табличек,
# включая последнюю со степенями двойки.
# Теперь он хочет взять третью степень чисел от 1 до абсолютно любого!

# Напишите программу,
# которая возводит в третью степень каждое число от 1 до N
# и выводит результат на экран.