print('Задача 5. Счастливый билетик')
a = [int(i) for i in input('Введите номер билета: ')]
if sum(a[:3]) == sum(a[3:]):
    print('Счастливый ')
else:
    print('Не счастливый')
# В старину, когда даже в столице билеты в общественном транспорте выдавали контролёры,
# существовало поверье:
# если на билете сумма первых трёх цифр в номере билета равна сумме последних трёх,
# то это к удаче.
#
# Напишите программу,
# которая получала бы на входе шестизначный номер билета
# и выводила, счастливый это билет или нет.
# К примеру, билеты 666 666 и 252 135 — счастливые,
# а 123 456 — нет.
# Подумайте, нужны ли для решения этой задачи циклы?