print('Задача 9. Коровы')

free_busy = input()
score = 0
milk = 0
total_milk = 0

for i in free_busy:
    score += 1
    if i == 'b':
        milk = score * 2
        total_milk += milk

print('Всего молока за день:', total_milk)
# Для коров есть 10 стойл.
# В каждом стойле разные условия для животных, поэтому и молока они дают по-разному.
# В первом стойле производят 2 литра в день,
# во втором 4, 
# в третьем - 6, потом 8, 10, 12, 14, 16, 18, 20. 
# Но коровы стоят не во всех стойлах. 
# Свободные и занятые обозначаются строкой из букв a и b,
# где a - свободное стойло, b - занятое.
# 
# Пользователь вводит строку из 10 символов a и b.
# Необходимо определить, сколько в итоге будет произведено молока за день.